{"config": [{"config": {"data_format": "channels_last", "padding": "valid", "name": "conv2d_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 32, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "activation": "relu", "name": "conv2d_2", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 32, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow"}